# running in sby/wb_hyperram_bmc/src/
read -formal wb_hyperram.v hyperram.v register_rw.v
prep -top wb_hyperram

memory_nordff
clk2fflogic
chformal -live -fair -cover -remove
opt_clean
setundef -anyseq
opt -keepdc -fast
check
hierarchy -simcheck
write_ilang ../model/design.il
